6. (7)
Не решена
Обозначим булево множество как 
B
B. Иначе говоря, 
B
=
{
0
,
1
}
B={0,1}. Будем считать, что 
0
<
1
0<1. Будем обозначать операцию отрицания как 
!
!, то есть 
!
0
=
1
!0=1, 
!
1
=
0
!1=0. Для наборов переменных 
x
=
[
x
1
,
x
2
,
…
,
x
n
]
x=[x 
1
​
 ,x 
2
​
 ,…,x 
n
​
 ] будем обозначать как 
!
x
!x покомпонентное отрицание: 
!
x
=
[
!
x
1
,
!
x
2
,
…
,
!
x
n
]
!x=[!x 
1
​
 ,!x 
2
​
 ,…,!x 
n
​
 ].

Рассмотрим булевы функции: функции, которые принимают 
n
n булевых аргументов и возвращают булево значение, то есть 
f
:
B
n
→
B
f:B 
n
 →B. Булева функция называется монотонной, если при увеличении её аргумента значение может только увеличиться. Иначе говоря, если наборы из 
n
n аргументов 
x
x и 
y
y таковы, что для всех 
i
i выполнено 
x
i
≤
y
i
x 
i
​
 ≤y 
i
​
 , то 
f
(
x
)
≤
f
(
y
)
f(x)≤f(y). Булева функция называется самодвойственной, если 
f
(
!
x
)
=
!
f
(
x
)
f(!x)=!f(x).

Сколько существует самодвойственных монотонных функций от 
3
3 аргументов?