Ограничение времени	2 секунды
Ограничение памяти	256 Мб
Ввод	стандартный ввод
Вывод	стандартный вывод
Даны две строки, состоящие из символов 
0
0 и 
1
1: строка 
A
A длины 
n
n и строка 
B
B длины 
m
m (
m
≤
n
m≤n).

Расстоянием Хэмминга между двумя строками одинаковой длины называется количество позиций, в которых символы различны.

Необходимо найти минимальное расстояние Хэмминга между строкой 
B
B и любой подстрокой 
A
A длины 
m
m.

Формат ввода
В первой строке записаны два целых числа 
n
n и 
m
m (
1
≤
m
≤
n
≤
500
000
1≤m≤n≤500000).

Во второй строке записана строка 
A
A длины 
n
n.

В третьей строке записана строка 
B
B длины 
m
m.

Формат вывода
Выведите одно целое число — минимальное растояние Хэмминга между строкой 
B
B и какой-либо подстрокой 
A
A длины 
m
m.

Пример
Ввод
Вывод
7 3
1100100
101
1
