Даны две строки, состоящие из символов 

0 и 
1: строка 

A длины 

n и строка 

B длины 

m (
m
≤
n

Расстоянием Хэмминга между двумя строками одинаковой длины называется количество позиций, в которых символы различны.

Необходимо найти минимальное расстояние Хэмминга между строкой 

B и любой подстрокой 
A длины 
m


Формат ввода
В первой строке записаны два целых числа 

n и 

m
(1≤m≤n≤500000).

Во второй строке записана строка 

A длины 
n

В третьей строке записана строка 
B длины 
m

Формат вывода
Выведите одно целое число — минимальное растояние Хэмминга между строкой 
B и какой-либо подстрокой 

A длины 
m
