8. (11)
Не решена
Ограничение времени	1 секунда
Ограничение памяти	256 Мб
Ввод	стандартный ввод
Вывод	стандартный вывод
Дано целое число 
n
n.

Требуется найти количество различных невырожденных остроугольных треугольников, таких, что длины всех их сторон — целые числа, не превосходящие 
n
n.

Треугольник называется невырожденным, если он имеет положительную площадь, иначе говоря, три его вершины не лежат на одной прямой. Треугольники считаются различными, если наборы длин их сторон различны как мультимножества.

Формат ввода
В первой строке записано одно целое число 
n
n (
3
≤
n
≤
5
000
3≤n≤5000).

Формат вывода
Выведите одно целое число — количество различных невырожденных остроугольных треугольников, таких, что длины всех их сторон — целые числа, не превосходящие 
n
n.

Пример 1
Ввод
Вывод
3
6
Пример 2
Ввод
Вывод
10
81